; domain
(define (domain delivery)
    (:requirements :typing :equality :negative-preconditions :constraints)
    (:types
        cell - object
        locatable - object
        package - locatable
        truck - locatable
    )

    (:predicates
        (at ?x1 - locatable ?x2 - cell)
        (carrying ?x1 - truck ?x2 - package)
        (empty ?x1 - truck)
        (adjacent ?x1 - cell ?x2 - cell)
    )

    (:action pick-package
     :parameters (?t - truck ?p - package ?x - cell)
     :precondition (and (at ?p ?x) (at ?t ?x) (empty ?t))
     :effect (and
        (not (at ?p ?x))
        (not (empty ?t))
        (carrying ?t ?p))
    )

    (:action drop-package
     :parameters (?t - truck ?p - package ?x - cell)
     :precondition (and (at ?t ?x) (carrying ?t ?p))
     :effect (and
        (empty ?t)
        (not (carrying ?t ?p))
        (at ?p ?x))
    )

    (:action move
     :parameters (?t - truck ?from - cell ?to - cell)
     :precondition (and (adjacent ?from ?to) (at ?t ?from) (not (= ?from ?to)))
     :effect (and
        (not (at ?t ?from))
        (at ?t ?to))
    )
)

; problem
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Instance file automatically generated by the Tarski FSTRIPS writer
;;; 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (problem delivery-2x2-5-76)
    (:domain delivery)

    (:objects
        c_0_0 c_0_1 c_1_0 c_1_1 - cell
        p1 p2 p3 p4 p5 - package
        t1 - truck
    )

    (:init
        (adjacent c_0_0 c_0_1)
        (adjacent c_1_0 c_1_1)
        (adjacent c_0_1 c_1_1)
        (adjacent c_1_1 c_0_1)
        (adjacent c_0_0 c_1_0)
        (adjacent c_1_0 c_0_0)
        (adjacent c_0_1 c_0_0)
        (adjacent c_1_1 c_1_0)
        (at p5 c_0_1)
        (at p4 c_1_0)
        (at p2 c_1_1)
        (at t1 c_1_0)
        (at p1 c_1_0)
        (at p3 c_0_0)
        (empty t1)
    )

    (:goal
        (and (at p1 c_1_0) (and (at p2 c_1_0) (and (at p3 c_1_0) (and (at p4 c_1_0) (at p5 c_1_0)))))
    )

    
    
    

  (:constraints
    (and
      (always (not (at p1 c_0_0)))
      (always (not (at p2 c_0_0)))
      (always (not (at p3 c_0_1)))
      (always (not (at p4 c_0_0)))
      (always (not (at p5 c_0_0)))
    )
  )
)

; plan
1. (move t1 c_1_0 c_1_1)
   deleted: (at t1 c_1_0)
   added: (at t1 c_1_1)
   goals met: 1 of 2
2. (pick-package t1 p2 c_1_1)
   deleted: (at p2 c_1_1) (empty t1)
   added: (carrying t1 p2)
   goals met: 1 of 2
3. (move t1 c_1_1 c_0_1)
   deleted: (at t1 c_1_1)
   added: (at t1 c_0_1)
   goals met: 1 of 2
4. (move t1 c_0_1 c_0_0)
   deleted: (at t1 c_0_1)
   added: (at t1 c_0_0)
   goals met: 1 of 2
5. (move t1 c_0_0 c_1_0)
   deleted: (at t1 c_0_0)
   added: (at t1 c_1_0)
   goals met: 1 of 2
6. (drop-package t1 p2 c_1_0)
   deleted: (carrying t1 p2)
   added: (empty t1) (at p2 c_1_0)
   goals met: 1 of 2
7. (move t1 c_1_0 c_0_0)
   deleted: (at t1 c_1_0)
   added: (at t1 c_0_0)
   goals met: 1 of 2
8. (pick-package t1 p3 c_0_0)
   deleted: (at p3 c_0_0) (empty t1)
   added: (carrying t1 p3)
   goals met: 1 of 2
9. (move t1 c_0_0 c_1_0)
   deleted: (at t1 c_0_0)
   added: (at t1 c_1_0)
   goals met: 1 of 2
10. (drop-package t1 p3 c_1_0)
   deleted: (carrying t1 p3)
   added: (empty t1) (at p3 c_1_0)
   goals met: 1 of 2
11. (move t1 c_1_0 c_0_0)
   deleted: (at t1 c_1_0)
   added: (at t1 c_0_0)
   goals met: 1 of 2
12. (move t1 c_0_0 c_0_1)
   deleted: (at t1 c_0_0)
   added: (at t1 c_0_1)
   goals met: 1 of 2
13. (pick-package t1 p5 c_0_1)
   deleted: (at p5 c_0_1) (empty t1)
   added: (carrying t1 p5)
   goals met: 1 of 2
14. (move t1 c_0_1 c_0_0)
   deleted: (at t1 c_0_1)
   added: (at t1 c_0_0)
   goals met: 1 of 2
15. (move t1 c_0_0 c_1_0)
   deleted: (at t1 c_0_0)
   added: (at t1 c_1_0)
   goals met: 1 of 2
16. (drop-package t1 p5 c_1_0)
   deleted: (carrying t1 p5)
   added: (empty t1) (at p5 c_1_0)
   goals met: 2 of 2
